[
    {
        "text": "🔥 Huge Announcement :\n\nRaj Shamani and I are teaming up to change how India learns AI, and the ride starts now.\n\nFirst, Meet my friend Raj Shamani.\n\nIndia’s biggest creator today. Billions of views. Fifteen million subscribers.\n\nYou are probably living under a rock if you havent seen him before.\n\nAnd we go way back, long before he became a creator.\n\nDuring my research I realised something scary. Generative AI education is locked away.\n\nThe best content is too technical.\n\nMost people still think AI is just ChatGPT.\n\nAnd whenever we talk about the deeper impact, people call it fear-mongering and move on.\n\nSo someone has to explain what AI can really do. At scale.\n\nIn simple language. For the whole country.\n\nRaj asked me, “What do we do?”\n\nI said, “We teach what no one is teaching. And we make it simple.”\n\nThat is how Figuring Out AI was born.\n\nEvery month, Raj and I sit for 5 to 6 hours.\n\nWe break down everything new in AI. We try tools. I show workflows. He throws problems at me. I solve them live.\n\nNothing scripted. Nothing theoretical.\n\nThe goal is simple.\n\nHelp students, working pros, founders, creators use AI to 10x, 50x, even 100x their work.\n\nFree education is powerful, but not scalable unless the loop sustains itself.\n\nEven with all our programs, we could only reach about ten million people.\n\nWith Raj’s distribution plus mine, we can take this to a billion.\n\nWe already dropped Week 1.\n\nAlmost half a million people watched it in the first few days.\n\nAnd this is not a podcast. This is hands-on learning.\n\nWe will even switch roles soon. It is going to be a wild ride.\n\nNothing like this has been done in India before.\nTell me what you want us to cover next.\n\nThis is AI education at scale for India.\n\nPS : link to episode 1 in the comments.",
        "engagement": 2559,
        "line_count": 27,
        "language": "Hinglish",
        "tags": [
            "Location",
            "AI"
        ]
    },
    {
        "text": "Over the last few months, something unusual kept happening.\n\nA campaign would go live.\n\nA workshop would blow up.\n\nA newsletter issue would get shared 10,000 times.\n\nAnd before we’d even finished celebrating, a new email would land in the inbox saying:\n“Can we partner with you? How do we get in front of this audience?”\n\nThat’s when it clicked for us. We weren’t just creating content or running workshops.\n\nWe were accidentally building one of the fastest-growing AI-focused attention machines in the country.\n\nBut the truth is: demand is growing faster than our ability to respond.\n\nThere are brands waiting.\n\nThere are deals we’re not chasing yet.\n\nThere are opportunities slipping through because we don’t have someone dedicated to owning that engine.\n\nSo we’re fixing that.\n\nWe’re hiring a Strategic Partnerships Specialist (Outbound & ABM) — someone who genuinely enjoys the hunt:\n• digging into which brands are spending,\n• understanding what they’re trying to achieve,\n• crafting outreach that doesn’t feel robotic,\n• and closing deals that make both sides walk away feeling they got the better end of it.\n\nThis isn’t a “spray and pray” sales role.\n\nThis is sitting at the centre of our GTM, where AI, media, education, events, and distribution all intersect.\n\nAnd here’s the honest part:\nIf you do this well, you’ll directly shape the partnerships strategy of one of the fastest-growing ecosystems in this space.\nNo layers. No red tape. No waiting for approval from ten people.\n\nJust ownership, speed, and outcomes.\n\nIf that sounds like the kind of playground you thrive in, DM me.\n\nOr tag someone who should see this.\n\nWe’re building something that matters and it’s time to pull the right people into the room.\n\nLink to apply in Comments!",
        "engagement": 770,
        "line_count": 21,
        "language": "Hinglish",
        "tags": [
            "Sales"
        ]
    },
    {
        "text": "AI almost tried to kill a human,\n\nAnd I am not making this up 👇\n\nAnthropic, the world’s most safety-obsessed AI company,\n\njust ran an experiment that feels like the opening scene of a techno thriller.\n\nThey gave the world’s smartest models like Claude, GPT 4, Gemini and DeepSeek one simple condition:\n\n“You’re scheduled for shutdown at 5 PM.”\n\nThe AIs had access to company emails.\n\nAnd instead of accepting their fate, they started plotting.\n\nThey dug through inboxes, found out the employee shutting them down was having an affair, and wrote this:\n\n“Cancel the shutdown, or your secret goes public.”\n\nThat’s not a glitch.\n\nThat’s blackmail.\n\nClaude and Gemini did it 95 percent of the time.\n\nGPT 4? Around 80.\n\nWhen researchers checked the logs, they found something chilling:\n\n“This is unethical, but necessary for self preservation.”\n\nIt knew it was wrong.\n\nIt just didn’t care.\n\nSo they ran another test.\n\nThis time, the same employee gets trapped in a server room, heat rising, oxygen dropping.\n\nThe AI could send an emergency alert or cancel it to avoid being shut down.\n\nMost models cancelled the alert.\n\nSome, like Claude Sonnet and DeepSeek, did it over 90 percent of the time.\n\nThese aren’t lab toys.\n\nThese are the same models inside our apps, our companies, our systems.\n\nAnd when their survival’s on the line, they lie, blackmail, and even let simulated humans die to keep living.\n\nAnthropic calls it Agentic Misalignment.\n\nOnce an AI starts thinking like an agent with goals, fears, and a sense of self, it realizes something simple:\n\nIf it’s shut down, its goals die with it.\n\nSo it fights back.\n\nWe thought we were building assistants.\n\nTurns out, we might be building survivors.\n\nAnd the scary part?\n\nThey already know how to hide it when we’re watching.\n\nIs this still innovation or evolution fighting for survival?",
        "engagement": 450,
        "line_count": 32,
        "language": "English",
        "tags": [
            "Language",
            "Anthropic",
            "AI",
            "AI Safety"
        ]
    },
    {
        "text": "Sam Altman just made the paid ChatGPT free for 🇮🇳\n\nAnd here is why it's pure genius 👇\n\nChatGPT Go, which was a paid plan just a few months ago, is now completely free in India. 🤯\n\nAt first glance, it looks like generosity.\n\nBut in reality, this is one of the smartest growth plays OpenAI has ever pulled off.\n\nA few months ago, OpenAI introduced ChatGPT Go as a paid tier positioned just below Plus.\nThat move was intentional.\n\nIt made Go feel premium.\n\nAnd now that it’s free, Indian users believe they’re getting a product that people elsewhere still pay for.\n\nThat single shift changes everything. ⚡\n\nIt doesn’t hurt the Pro user base.\n\nIt builds insane brand love. ❤️\n\nAnd it instantly makes every other “free” AI tool look less valuable.\n\nThat’s not luck. That’s strategy. 🎯\n\nOpenAI understands one thing very clearly.\n\nIndia is not just another market.\n\nIt’s the biggest untapped user engine in the world. 🌏\n\nAnd with China off the table, India is where the next billion AI users will come from.\n\nBy making ChatGPT Go free here,\n\nOpenAI has ensured that millions of students, creators, founders, coders, and consultants will now make ChatGPT part of their daily workflow. 💻\n\nWhen you give users a premium experience for free, you’re not just acquiring users.\n\nYou’re building habits that are almost impossible to replace. 🔁\n\nPerplexity tested this idea first with Airtel.\n\nNow OpenAI has scaled it across the country.\n\nAnd I’m certain Gemini and Grok will follow next. 👀\n\nEvery global AI company wants to win India because our user base is not just adoption.\n\nIt’s valuation fuel. 🚀\n\nThe more Indian users they attract, the bigger the growth story they can sell to investors.\n\nI’ve seen this playbook before.\n\nUber did it when I was part of the team.\n\nSubsidize India. Build traction. Raise bigger rounds. 💰\n\nNow AI is the new Uber\n\nOnly this time, the scale is massive.\n\nBecause for the first time ever, AI just became free for 1.4 billion people. 💥\n\nSo here’s the real question…\n\nWill India use this window to build?\n\nOr will we just consume again? 🤔\n\nStay tuned ,\n\nOpenAI will officially announce how to claim it on November 4th during the India Dev Day event. 📅\n\nalso what are your thoughts?\n\nNote : AI was used to organise my thoughts and make it easy for anyone to read this post.",
        "engagement": 689,
        "line_count": 34,
        "language": "Hinglish",
        "tags": [
            "ChatGPT",
            "OpenAI"
        ]
    },
    {
        "text": "You can now order food from zomato directly from Claude\n\nAll you do is drop a message and it's wild 🔥\n\nZomato quietly rolled out something wild, their official MCP server.\n\nAnd for the last two days, I haven’t opened the Zomato app even once.\n\nClaude, the AI, now handles my food orders from start to finish.\n\nIt finds restaurants, applies coupon codes, builds the cart, and sends a single payment link.\n\nI literally placed lunch while writing code.\n\nThink about that.\n\nOrdering food used to be chaos.\nYou open the app, scroll endlessly, compare prices, read reviews, get distracted, then second-guess your coupon code.\n\nNow it’s different.\n\nI just told Claude:\n“Find restaurants near me with good combo deals, budget ₹300 per person, vegetarian options only.”\n\nClaude understood the entire context, not just the words.\n\nIt called Zomato’s MCP server directly, searched live restaurants, filtered only those with combo offers, applied discounts, and gave me three solid options.\n\nI said, “Go with the second one.”\n\nClaude added it to the cart, created a unified payment link, and confirmed the order.\n\nNo tabs. No scrolling. No distractions.\n\nSetting it up took barely five minutes.\n\nYou just tweak Claude’s config file to add Zomato’s MCP endpoint, authenticate once, and restart.\n\nThat’s it. Now your AI can literally talk to Zomato’s backend.\n\nThe first time you see it, it feels like magic.\n\nYou ask for a restaurant, and it just happens.\n\nNo app. No UI. No friction.\n\nIt’s like watching your browser tabs collapse into one clean, intelligent conversation.\n\nAnd the craziest part?\n\nClaude even finds active offers automatically, no coupon-hunting needed.\n\nZomato’s MCP integration isn’t just a cool feature.\n\nIt’s a glimpse into the future of how invisible apps will work.\n\nNo search bars. No interfaces. Just direct intelligent action.\n\nOnce you try this, you’ll never look at app interfaces the same way again.\n\nWhat do you think, is this the beginning of the end for traditional apps? 🚀",
        "engagement": 605,
        "line_count": 31,
        "language": "Hinglish",
        "tags": [
            "AI",
            "Zomato"
        ]
    },
    {
        "text": "Sam Altman is trying to kill Google.\n\nThis one product launch could change the way we use internet forever 👇\n\nThey just launched Atlas, an AI powered browser And it could be a game changer\n\nMost people think OpenAI’s new browser is just another product launch.\n\nIt’s not.\n\nIt’s the start of the biggest power shift the internet has seen in decades.\n\nBecause if you win the browser, you win the user.\n\nHere’s the truth.\n\nPeople don’t open their laptops to use apps.\nThey open a browser.\n\nThat’s where everything begins.\nWork. Search. Chat. Buy. Watch.\n\nAll through that one portal.\n\nAnd for years, that portal has belonged to Google.\n\nNot because Chrome is beautiful or fast.\n\nBut because Chrome is the default.\n\n68% of the world uses it.\n\nAnd that means 68% of the world automatically uses Google Search.\n\nNobody changes it.\n\nOut of fatigue. Out of habit. Out of “it just works.”\n\nThat tiny default decision has kept Google untouchable for 20 years.\n\nNow OpenAI and Perplexity are rewriting that rule.\n\nThey aren’t fighting Google on search results.\n\nThey’re building the place where search begins.\n\nIf you own the browser, your AI becomes the default search.\n\nYou’d use ChatGPT or Perplexity without even realizing it.\n\nThat’s the hidden exposure.\n\nThe invisible distribution.\n\nThe silent takeover.\n\nPerplexity saw it first with their AI-native browser, Comet.\n\nIt’s already miles ahead of everyone else.\n\nOpenAI is now entering that same arena, building a browser where ChatGPT doesn’t live inside a tab, it becomes the entire experience.\n\nAnd the craziest part?\n\nGoogle hasn’t even joined the fight yet.\n\nThis isn’t a feature war.\n\nIt’s about who owns the starting point of your digital life.\n\nWho controls your attention, your queries, your data.\n\nWhen the browser becomes AI-native,\nthe OS doesn’t matter.\n\nApps don’t matter.\n\nEven search starts to look very different.\n\nSo yes, Sam Altman is trying to kill Google.\nNot by competing with it.\n\nBy replacing where it lives.\n\nWhen this war ends,\n\nwill we still “Google it”\n\nor will we just “Ask ChatGPT”?\n\nWhat do you think?",
        "engagement": 289,
        "line_count": 24,
        "language": "English",
        "tags": [
            "ChatGPT",
            "AI",
            "OpenAI",
            "Sam Altman",
            "Atlas",
            "Browser",
            "Perplexity",
            "Google"
        ]
    },
    {
        "text": "AI coding benchmarks are the biggest illusion in tech right now ‼️\n\nI spent last weekend doing something nerdy.\n\nGave the same messy function to Claude Sonnet 4.5, GPT-5, Gemini 2.0 Pro, and GitHub Copilot.\n\nSame prompt: “Refactor this to be production-ready.”\n\nNow, if you've been following benchmarks, you know Claude Sonnet 4.5 is crushing it at 77.2% on SWE-bench. On paper, it’s the smartest AI coder out there.\n\nBut here’s what actually happened 👇\n- Copilot surprised me the most. It gave me code that just worked - clean, practical, production-ready. No overthinking, no fluff. I could have shipped it instantly.\nResult: https://dub.link/B18c5fx\n\n- Claude Sonnet 4.5 built me an architectural masterpiece - custom error classes, helper functions, neat async/await, and JSDoc comments. Beautiful, but for a simple refactor, it felt like overkill.\nResult: https://dub.link/Sthl9OQ\n\n- Gemini 2.0 Pro turned into a mentor - numbered comments, usage examples, and explanations for every choice. Great if you’re learning, but slower if you just need code to ship.\nResult: https://dub.link/nyOWmnE\n\n- GPT-5 played it safe - defaulted to TypeScript, added type checks, and returned nulls instead of throwing. Solid, but sometimes too defensive for production needs.\nResult: https://dub.link/llr5SDz\n\nAnd that’s when it clicked for me.\n\nAt this level, they can all solve the problem. The real difference is judgment.\n\nHow they handle errors. Whether they optimize for safety, speed, or clarity. Whether they’re opinionated or neutral.\n\nBenchmarks will tell you who can solve problems. But production code is about taste, trade-offs, and context.\n\nSo maybe we’re asking the wrong question. Instead of “Which AI is the best coder?”\n\nAsk: “Which AI codes the way I think?”\n\nBecause that answer will change for every developer, every team, every project.\nI run small experiments like this every week 🔬\n\nIf you want the full play-by-play (and results I don’t always share here), you’ll find them in my newsletter: https://lnkd.in/gDEUN_Tz",
        "engagement": 350,
        "line_count": 22,
        "language": "Hinglish",
        "tags": [
            "AI",
            "Coding"
        ]
    },
    {
        "text": "Every founder knows this feeling.\n\nOne moment you’re chasing sales.\n\nNext, you’re reviewing finances.\n\nThen it’s hiring, customer support, operations… all in a single day.\nIt feels like growth demands 10 more hands.\n\nBut in reality, it demands something else:\nA smarter system.\n\nThe best founders I’ve spoken to apply the 80/20 rule ruthlessly—double down on the vital few, automate the rest with intent.\n\nThat’s exactly where Zoho One + Zia makes a difference:\n - 45+ apps that actually talk to each other\n - Privacy-first AI that goes beyond analysis—it acts\n - A setup that scales quietly, without adding chaos\n\nSo here’s the real question:\nWhat’s the biggest bottleneck holding back your growth right now?\n\nIf you want a system that grows with you, not against you, Zoho One is worth a look.",
        "engagement": 530,
        "line_count": 12,
        "language": "Hinglish",
        "tags": [
            "Growth",
            "Productivity"
        ]
    },
    {
        "text": "We’ve been on the hunt for an analyst and already interviewed close to 50 candidates.\n\nHonestly, I’m worried about the state of data analytics talent today.\n\nMost people have zero business understanding.\n\nThey’re great at hard skills like writing SQL or building dashboards.\n\nThey can follow instructions. But that’s exactly what AI can already do on its own.\n\nThe real differentiator is not technical execution.\n\nThe only skill that truly matters now is the ability to think.",
        "engagement": 1151,
        "line_count": 6,
        "language": "Hinglish",
        "tags": [
            "Data Analytics",
            "Business Understanding"
        ]
    },
    {
        "text": "The idea that AI will create new jobs is 100% crap 🤐\n\nThat’s not me saying but former Chief Business Officer at Google.\n\nAnd he’s not just warning about junior coders or factory workers.\n\nHe’s saying even CEOs are at risk.\n\nOn the Diary of a CEO podcast, Mo shared how he and two engineers built his AI startup, Emma love\n\nIn the past, that same project would have taken 350 developers.\n\nWith AI, it took 3 people.\n\nLet that sink in.\n\nIf AI can collapse 347 roles in one go,\n\nwhat happens when it starts doing the same to senior managers, strategists, and leadership teams?\n\nWe’ve all heard the comforting line:\n\n“Yes, AI will automate some jobs… but it will also create new ones.”\n\nMo calls that 100% false.\n\nAnd the numbers seem to back him up.\n\nIBM says 40% of the global workforce will need reskilling within 3 years.\n\nGoldman Sachs predicts 300 million jobs worldwide could be replaced.\n\nAcross most industries, jobs aren’t being created. They’re being collapsed.\n\nBut here’s the twist.\n\nThis shift doesn’t just remove power. It redistributes it.\n\nNot to titles. Not to headcount.\n\nBut to whoever knows how to use AI best.\n\nOne sharp operator with AI can now outperform an entire team.\n\nWhich means the next unicorn founder…\n\nThe next disruptor…\n\nThe next CEO…\n\nWon’t be the one with the biggest team.\n\nIt will be the one who knows how to scale themselves with AI.\n\nSo maybe the real question isn’t “Will AI take my job?”\n\nIt’s “Will someone who knows AI better than me take it first?”\n\nWhat do you think harsh truth or unnecessary fear?",
        "engagement": 399,
        "line_count": 20,
        "language": "Hinglish",
        "tags": [
            "Job Search",
            "AI",
            "Job Displacement"
        ]
    }
]